package j0522;

public class C0522_11_상속 {

	public static void main(String[] args) {
		
		// 클래스 사용하는 방법 2가지 (1. 상속 / 2. 포함)
		
		// 1. 상속 
		// => 잘 안쓰임. 객체 배열로 대체. 개념만 알기. 
		// + 추상클래스, 인터페이스, 다형성(중요) 사용 시 알아야함!!!
		
		// 상속: 부모 자식 손자 끼리 관계가 있지만, 자식1 자식2와는 아무 관계가 없음!!!
		// + 부모가 바뀌면 자식, 손자 바뀌지만,/ 손자 바뀌면 자식, 부모 안바뀜
		
		// 2. 포함 = 객체 선언
		// 이제까지 우리가 한게 포함임.

		//////////////////
		// 원 만들기
		
		Circle c= new Circle(); // => (0,0)이 원점이고 r=100인 원이 기본으로 생성됨.
		
		
		
		
		
		
		
		
	}

}
